renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        switch (pipemode)
        {
            case USB_CUSE:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
                data = USB_M1.CFIFO.LONG;

#else  /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE2);

#endif /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
            break;
            default:
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE2);
            break;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        switch (pipemode)
        {
            case USB_CUSE:
                data = ptr->ipp1->CFIFO.LONG;
            break;
            case USB_D0USE:
                data = ptr->ipp1->D0FIFO.LONG;
            break;
            case USB_D1USE:
                data = ptr->ipp1->D1FIFO.LONG;
            break;
            default:
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE2);
            break;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    return data;
}
/******************************************************************************
 End of function hw_usb_read_fifo32
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_write_fifo32
 Description     : Data is written to the specified pipemode's FIFO register, 32-bits 
                 : wide, corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
                 : uint32_t  data      : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_write_fifo32(usb_utr_t *ptr, uint16_t pipemode, uint32_t data)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        switch (pipemode)
        {
            case USB_CUSE:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
                USB_M1.CFIFO.LONG = data;

#else  /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE2);

#endif /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
            break;
            default:
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE3);
            break;
        }
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        switch (pipemode)
        {
            case USB_CUSE:
                ptr->ipp1->CFIFO.LONG = data;
            break;
            case USB_D0USE:
                ptr->ipp1->D0FIFO.LONG = data;
            break;
            case USB_D1USE:
                ptr->ipp1->D1FIFO.LONG = data;
            break;
            default:
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE3);
            break;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

}
/******************************************************************************
 End of function hw_usb_write_fifo32
 ******************************************************************************/
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

/******************************************************************************
 Function Name   : hw_usb_read_fifo16
 Description     : Data is read from the specified pipemode's FIFO register, 16-bits 
                 : wide, corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 Return value    : CFIFO/D0FIFO/D1FIFO content (16-bit)
 ******************************************************************************/
uint16_t hw_usb_read_fifo16 (usb_utr_t *ptr, uint16_t pipemode)
{
    uint16_t data;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        switch (pipemode)
        {

            case USB_CUSE:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            data = USB_M1.CFIFO.WORD.H;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N) || defined(BSP_MCU_RX62N)
            data = USB_M1.CFIFO.WORD;

#endif  /* defined(BSP_MCU_RX63N) || defined(BSP_MCU_RX62N) */
#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
            data = USB_M0.CFIFO.WORD;

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
            break;
            default:
            USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE5);
            break;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_IP0 == ptr->ip)
        {
            switch (pipemode)
            {
                case USB_CUSE :
                    data = ptr->ipp->CFIFO.WORD;
                break;
                case USB_D0USE :
                    data = ptr->ipp->D0FIFO.WORD;
                break;
                case USB_D1USE :
                    data = ptr->ipp->D1FIFO.WORD;
                break;
                default :
                    USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE4);
                break;
            }
        }
#if USB_NUM_USBIP == 2
        else if (USB_IP1 == ptr->ip)
        {
            switch (pipemode)
            {
  #if USB_CFG_ENDIAN == USB_CFG_LITTLE
                case USB_CUSE:
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
                data = ptr->ipp1->CFIFO.WORD.H;
#else   /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                data = ptr->ipp1->CFIFO.WORD;
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                break;
                case USB_D0USE:
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
                data = ptr->ipp1->D0FIFO.WORD.H;
#else   /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                data = ptr->ipp1->D0FIFO.WORD;
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                break;
                case USB_D1USE:
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
                data = ptr->ipp1->D1FIFO.WORD.H;
#else   /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                data = ptr->ipp1->D1FIFO.WORD;
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                break;

