renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
  #else   /* USB_CFG_ENDIAN == USB_CFG_LITTLE */
                case USB_CUSE:
    #if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
                data = ptr->ipp1->CFIFO.WORD.L;
    #else   /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                data = ptr->ipp1->CFIFO.WORD;
    #endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                break;
                case USB_D0USE:
    #if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
                data = ptr->ipp1->D0FIFO.WORD.L;
    #else   /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                data = ptr->ipp1->D0FIFO.WORD;
    #endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                break;
                case USB_D1USE:
    #if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
                data = ptr->ipp1->D1FIFO.WORD.L;
    #else   /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                data = ptr->ipp1->D1FIFO.WORD;
    #endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                break;

  #endif  /* USB_CFG_ENDIAN == USB_CFG_LITTLE */

                default:
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE5);
                break;
            }
        }
#endif /* USB_NUM_USBIP == 2 */
        else
        {
            /* None */
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    return data;
}
/******************************************************************************
 End of function hw_usb_read_fifo16
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_write_fifo16
 Description     : Data is written to the specified pipemode's FIFO register, 16-bits 
                 : wide, corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
                 : uint16_t  data      : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_write_fifo16 (usb_utr_t *ptr, uint16_t pipemode, uint16_t data)
{
    uint16_t    ip;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
  #if USB_CFG_USE_USBIP == USB_CFG_IP1
        ip = USB_IP1;
  #else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        ip = USB_IP0;

  #endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ip = ptr->ip;
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    if (USB_IP0 == ip)
    {
        switch (pipemode)
        {
            case USB_CUSE :
                USB0_CFIFO16 = data;
            break;
            case USB_D0USE :
                USB0_D0FIFO16 = data;
            break;
            case USB_D1USE :
                USB0_D1FIFO16 = data;
            break;
            default :
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE6);
            break;
        }
    }
#if USB_NUM_USBIP == 2
    else if (USB_IP1 == ip)
    {
        switch (pipemode)
        {
            case USB_CUSE :
                USB1_CFIFO16 = data;
            break;
            case USB_D0USE :
                USB1_D0FIFO16 = data;
            break;
            case USB_D1USE :
                USB1_D1FIFO16 = data;
            break;
            default :
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE7);
            break;
        }
    }
#endif  /* USB_NUM_USBIP == 2 */
    else
    {
        USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE8);
    }
}
/******************************************************************************
 End of function hw_usb_write_fifo16
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_write_fifo8
 Description     : Data is written to the specified pipemode's FIFO register, 8-bits 
                 : wide, corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
                 : uint8_t  data       : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_write_fifo8 (usb_utr_t *ptr, uint16_t pipemode, uint8_t data)
{
    uint16_t    ip;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
  #if USB_CFG_USE_USBIP == USB_CFG_IP1
        ip = USB_IP1;
  #else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        ip = USB_IP0;

  #endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ip = ptr->ip;
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    if (USB_IP0 == ip)
    {
        switch (pipemode)
        {
            case USB_CUSE :
                USB0_CFIFO8 = data;
            break;
            case USB_D0USE :
                USB0_D0FIFO8 = data;
            break;
            case USB_D1USE :
                USB0_D1FIFO8 = data;
            break;
            default :
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE9);
            break;
        }
    }
#if USB_NUM_USBIP == 2
    else if (USB_IP1 == ip)
    {
        switch (pipemode)
        {
            case USB_CUSE :
                USB1_CFIFO8 = data;
            break;
            case USB_D0USE :
                USB1_D0FIFO8 = data;
            break;
            case USB_D1USE :
                USB1_D1FIFO8 = data;
            break;
            default :
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE10);
            break;
        }
    }
#endif  /* USB_NUM_USBIP == 2 */
    else
    {
        USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE11);
    }
}
/******************************************************************************
 End of function hw_usb_write_fifo8
 ******************************************************************************/

