renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_clear_status_bemp
 Description     : Clear the PIPExBEMP status bit of the specified pipe to clear 
                 : its BEMP interrupt status.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno: Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_status_bemp (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.BEMPSTS.WORD = (uint16_t) ((~(1 << pipeno)) & BEMPSTS_MASK);
#else
        USB_M1.BEMPSTS.WORD = (uint16_t) ((~(1 << pipeno)) & BEMPSTS_MASK);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ptr->ipp->BEMPSTS.WORD = (uint16_t) (~(1 << pipeno)) & BEMPSTS_MASK;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_status_bemp
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_read_frmnum
 Description     : Returns FRMNUM register content.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
 Return value    : FRMNUM content
 ******************************************************************************/
uint16_t hw_usb_read_frmnum (usb_utr_t *ptr)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        return (uint16_t)USB_M0.FRMNUM.WORD;
#else
        return (uint16_t)USB_M1.FRMNUM.WORD;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        return (uint16_t) ptr->ipp->FRMNUM.WORD;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    return 0;
}
/******************************************************************************
 End of function hw_usb_read_frmnum
 ******************************************************************************/

#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
/******************************************************************************
 Function Name   : hw_usb_read_usbreq
 Description     : Returns USBREQ register content.
 Arguments       : none
 Return value    : USBREQ content
 ******************************************************************************/
uint16_t hw_usb_read_usbreq(void)
{
#if USB_CFG_USE_USBIP == USB_CFG_IP0
    return (uint16_t)USB_M0.USBREQ.WORD;
#else
    return (uint16_t)USB_M1.USBREQ.WORD;
#endif
}
/******************************************************************************
 End of function hw_usb_read_usbreq
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_read_usbval
 Description     : Returns USBVAL register content.
 Arguments       : none
 Return value    : USBVAL content
 ******************************************************************************/
uint16_t hw_usb_read_usbval(void)
{
#if USB_CFG_USE_USBIP == USB_CFG_IP0
    return (uint16_t)USB_M0.USBVAL;
#else
    return (uint16_t)USB_M1.USBVAL;
#endif
}
/******************************************************************************
 End of function hw_usb_read_usbval
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_read_usbindx
 Description     : Returns USBINDX register content.
 Arguments       : none
 Return value    : USBINDX content
 ******************************************************************************/
uint16_t hw_usb_read_usbindx(void)
{
#if USB_CFG_USE_USBIP == USB_CFG_IP0
    return (uint16_t)USB_M0.USBINDX;
#else
    return (uint16_t)USB_M1.USBINDX;
#endif
}
/******************************************************************************
 End of function hw_usb_read_usbindx
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_read_usbleng
 Description     : Returns USBLENG register content.
 Arguments       : none
 Return value    : USBLENG content
 ******************************************************************************/
uint16_t hw_usb_read_usbleng(void)
{
#if USB_CFG_USE_USBIP == USB_CFG_IP0
    return (uint16_t)USB_M0.USBLENG;
#else
    return (uint16_t)USB_M1.USBLENG;
#endif
}
/******************************************************************************
 End of function hw_usb_read_usbleng
 ******************************************************************************/
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */

/******************************************************************************
 Function Name   : hw_usb_read_dcpcfg
 Description     : Returns DCPCFG register content.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
 Return value    : DCPCFG content
 ******************************************************************************/
uint16_t hw_usb_read_dcpcfg (usb_utr_t *ptr)
{
#if !defined(BSP_MCU_RX630)
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        return (uint16_t)USB_M0.DCPCFG.WORD;
#else
        return (uint16_t)USB_M1.DCPCFG.WORD;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        return (uint16_t) ptr->ipp->DCPCFG.WORD;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
#endif  /* !defined(BSP_MCU_RX630) */
    return 0;
}
/******************************************************************************
 End of function hw_usb_read_dcpcfg
 ******************************************************************************/

