renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
}
/******************************************************************************
 End of function hw_usb_write_pipeperi
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_read_pipectr
 Description     : Returns DCPCTR or the specified pipe's PIPECTR register content.
                 : The Pipe Control Register returned is determined by the speci-
                 : fied pipe number.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number.
 Return value    : PIPExCTR content
 ******************************************************************************/
uint16_t hw_usb_read_pipectr (usb_utr_t *ptr, uint16_t pipeno)
{
    R_BSP_VOLATILE_EVENACCESS uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        if (USB_PIPE0 == pipeno)
        {
            p_reg = (uint16_t *)&(USB_M0.DCPCTR);
        }
        else
        {
            p_reg = (uint16_t *)&(USB_M0.PIPE1CTR) + (pipeno - 1);
        }
#else
        if (USB_PIPE0 == pipeno)
        {
            p_reg = (uint16_t *)&(USB_M1.DCPCTR);
        }
        else
        {
            p_reg = (uint16_t *)&(USB_M1.PIPE1CTR) + (pipeno - 1);
        }
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_PIPE0 == pipeno)
        {
            p_reg = (uint16_t *) &(ptr->ipp->DCPCTR);
        }
        else
        {
            p_reg = (uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1);
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    return *p_reg;
}
/******************************************************************************
 End of function hw_usb_read_pipectr
 ******************************************************************************/

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
/******************************************************************************
 Function Name   : hw_usb_write_pipectr
 Description     : Specified data is written to the specified pipe's PIPEPERI register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_write_pipectr (usb_utr_t *ptr, uint16_t pipeno, uint16_t data)
{
    R_BSP_VOLATILE_EVENACCESS uint16_t *p_reg;

    if (USB_PIPE0 == pipeno)
    {
        p_reg = (uint16_t *) &(ptr->ipp->DCPCTR);
    }
    else
    {
        p_reg = (uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1);
    }
    *p_reg = data;

}
/******************************************************************************
 End of function hw_usb_write_pipectr
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 Function Name   : hw_usb_set_csclr
 Description     : Set CSCLR bit in the specified pipe's PIPECTR register
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_set_csclr (usb_utr_t *ptr, uint16_t pipeno)
{
    R_BSP_VOLATILE_EVENACCESS uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        p_reg = (uint16_t *)&(USB_M0.PIPE1CTR) + (pipeno - 1);
#else
        p_reg = (uint16_t *)&(USB_M1.PIPE1CTR) + (pipeno - 1);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        p_reg = (uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    (*p_reg) |= USB_CSCLR;
}
/******************************************************************************
 End of function hw_usb_set_csclr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_aclrm
 Description     : The ACLRM-bit (Auto Buffer Clear Mode) is set in the specified 
                 : pipe's control register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_set_aclrm (usb_utr_t *ptr, uint16_t pipeno)
{
    R_BSP_VOLATILE_EVENACCESS uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        p_reg = (uint16_t *)&(USB_M0.PIPE1CTR) + (pipeno - 1);
#else
        p_reg = (uint16_t *)&(USB_M1.PIPE1CTR) + (pipeno - 1);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        p_reg = (uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    (*p_reg) |= USB_ACLRM;
}
/******************************************************************************
 End of function hw_usb_set_aclrm
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_aclrm
 Description     : Clear the ACLRM bit in the specified pipe's control register
                 : to disable Auto Buffer Clear Mode.
                 : its BEMP interrupt status.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_aclrm (usb_utr_t *ptr, uint16_t pipeno)
{
    R_BSP_VOLATILE_EVENACCESS uint16_t *p_reg;

