renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        p_reg = (uint16_t *)&(USB_M0.PIPE1CTR) + (pipeno - 1);
#else
        p_reg = (uint16_t *)&(USB_M1.PIPE1CTR) + (pipeno - 1);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        p_reg = (uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    (*p_reg) &= (~USB_ACLRM);
}
/******************************************************************************
 End of function hw_usb_clear_aclrm
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_sqclr
 Description     : The SQCLR-bit (Toggle Bit Clear) is set in the specified pipe's 
                 : control register. Setting SQSET to 1 makes DATA0 the expected 
                 : data in the pipe's next transfer.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_set_sqclr (usb_utr_t *ptr, uint16_t pipeno)
{
    R_BSP_VOLATILE_EVENACCESS uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        if (USB_PIPE0 == pipeno)
        {
            USB_M0.DCPCTR.WORD |= USB_SQCLR;
        }
        else
        {
            p_reg = ((uint16_t *)&(USB_M0.PIPE1CTR) + (pipeno - 1));
            (*p_reg) |= USB_SQCLR;
        }
#else
        if (USB_PIPE0 == pipeno)
        {
            USB_M1.DCPCTR.WORD |= USB_SQCLR;
        }
        else
        {
            p_reg = ((uint16_t *)&(USB_M1.PIPE1CTR) + (pipeno - 1));
            (*p_reg) |= USB_SQCLR;
        }
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_PIPE0 == pipeno)
        {
            ptr->ipp->DCPCTR.WORD |= USB_SQCLR;
        }
        else
        {

            p_reg = ((uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1));
            (*p_reg) |= USB_SQCLR;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_sqclr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_sqset
 Description     : The SQSET-bit (Toggle Bit Set) is set in the specified pipe's 
                 : control register. Setting SQSET to 1 makes DATA1 the expected 
                 : data in the next transfer.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_set_sqset (usb_utr_t *ptr, uint16_t pipeno)
{
    R_BSP_VOLATILE_EVENACCESS uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        if (USB_PIPE0 == pipeno)
        {
            USB_M0.DCPCTR.WORD |= USB_SQSET;
        }
        else
        {
            p_reg = ((uint16_t *)&(USB_M0.PIPE1CTR) + (pipeno - 1));
            (*p_reg) |= USB_SQSET;
        }
#else
        if (USB_PIPE0 == pipeno)
        {
            USB_M1.DCPCTR.WORD |= USB_SQSET;
        }
        else
        {
            p_reg = ((uint16_t *)&(USB_M1.PIPE1CTR) + (pipeno - 1));
            (*p_reg) |= USB_SQSET;
        }
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_PIPE0 == pipeno)
        {
            ptr->ipp->DCPCTR.WORD |= USB_SQSET;
        }
        else
        {

            p_reg = ((uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1));
            (*p_reg) |= USB_SQSET;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_sqset
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_pid
 Description     : Set the specified PID of the specified pipe's DCPCTR/PIPECTR 
                 : register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
                 : uint16_t  data   : NAK/BUF/STALL.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_pid (usb_utr_t *ptr, uint16_t pipeno, uint16_t data)
{
    R_BSP_VOLATILE_EVENACCESS uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        if (USB_PIPE0 == pipeno)
        {
            p_reg = ((uint16_t *)&(USB_M0.DCPCTR));
        }
        else
        {
            p_reg = ((uint16_t *)&(USB_M0.PIPE1CTR) + (pipeno - 1));
        }
#else
        if (USB_PIPE0 == pipeno)
        {
            p_reg = ((uint16_t *)&(USB_M1.DCPCTR));
        }
        else
        {
            p_reg = ((uint16_t *)&(USB_M1.PIPE1CTR) + (pipeno - 1));
        }
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_PIPE0 == pipeno)
        {
            p_reg = ((uint16_t *) &(ptr->ipp->DCPCTR));
        }
        else
        {
            p_reg = ((uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1));
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    (*p_reg) &= (~USB_PID);
    (*p_reg) |= data;
}
/******************************************************************************
 End of function hw_usb_set_pid
 ******************************************************************************/

