renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        p_reg = (uint16_t *)&(USB_M0.PIPE1TRN) + ((pipeno - 1) * 2);
#else
        p_reg = (uint16_t *)&(USB_M1.PIPE1TRN) + ((pipeno - 1) * 2);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        p_reg = (uint16_t *) &(ptr->ipp->PIPE1TRN) + ((pipeno - 1) * 2);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    *p_reg = data;
}
/******************************************************************************
 End of function hw_usb_write_pipetrn
 ******************************************************************************/


#if USB_CFG_BC == USB_CFG_ENABLE
/******************************************************************************
 Function Name   : hw_usb_read_bcctrl
 Description     : Returns BCCTRL register content.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 Return value    : BCCTRL content
 ******************************************************************************/
uint16_t hw_usb_read_bcctrl(usb_utr_t *ptr)
{
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        return USB_M1.BCCTRL.WORD;

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_IP1 == ptr->ip)
        {
            return (uint16_t)ptr->ipp1->BCCTRL.WORD;

        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

    return 0;
} /* End of function hw_usb_read_bcctrl() */
/******************************************************************************
 End of function hw_usb_read_bcctrl
 ******************************************************************************/
#endif  /* USB_CFG_BC == USB_CFG_ENABLE */


#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
#if USB_CFG_BC == USB_CFG_ENABLE
/******************************************************************************
 Function Name   : hw_usb_set_vdmsrce
 Description     : Set VDMSRCE bit.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_vdmsrce(usb_utr_t *ptr)
{
    if (USB_IP1 == ptr->ip)
    {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        ptr->ipp1->BCCTRL.WORD |= USB_VDMSRCE;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
    }

}
/******************************************************************************
 End of function hw_usb_set_vdmsrce
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_vdmsrce
 Description     : Clear VDMSRCE bits.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_vdmsrce(usb_utr_t *ptr)
{
    if (USB_IP1 == ptr->ip)
    {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        ptr->ipp1->BCCTRL.WORD &= (~USB_VDMSRCE);

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
    }

}
/******************************************************************************
 End of function hw_usb_clear_vdmsrce
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_idpsinke
 Description     : Set IDPSINKE bit.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_idpsinke(usb_utr_t *ptr)
{
    if (USB_IP1 == ptr->ip)
    {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        ptr->ipp1->BCCTRL.WORD |= USB_IDPSINKE;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
    }

}
/******************************************************************************
 End of function hw_usb_set_idpsinke
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_idpsinke
 Description     : Clear IDPSINKE bits.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_idpsinke(usb_utr_t *ptr)
{
    if (USB_IP1 == ptr->ip)
    {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        ptr->ipp1->BCCTRL.WORD &= (~USB_IDPSINKE);

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
    }

}
/******************************************************************************
 End of function hw_usb_clear_idpsinke
 ******************************************************************************/

#endif  /* USB_CFG_BC == USB_CFG_ENABLE */
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
/******************************************************************************
 Function Name   : hw_usb_set_suspendm
 Description     : Set SUSPM bit.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void hw_usb_set_suspendm(void)
{
#if USB_CFG_USE_USBIP == USB_CFG_IP0

    /* Non */
#else
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    USB_M1.LPSTS.WORD |= USB_SUSPENDM;
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#endif
}
/******************************************************************************
 End of function hw_usb_set_suspendm
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_suspm
 Description     : Clear SUSPM bit.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_suspm(void)
{
#if USB_CFG_USE_USBIP == USB_CFG_IP0

    /* Non */
#else
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    USB_M1.LPSTS.WORD &= (~USB_SUSPENDM);
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#endif
}
/******************************************************************************
 End of function hw_usb_clear_suspm
 ******************************************************************************/

#endif  /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */

/******************************************************************************
 End of file
 ******************************************************************************/
